# Fictional Army - Filtering and Sorting

### Import libraries

In [1]:
import numpy as np
import pandas as pd

### Step 1. This is the data given as a dictionary. Create a dataframe and assign it to a variable called army.

In [2]:
# Create an example dataframe about a fictional army
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
            'deaths': [523, 52, 25, 616, 43, 234, 523, 62, None, 73, 37, 35],
            'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
            'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
            'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
            'readiness': [1, None, 3, None, 2, None, 2, None, None, 1, 2, None],
            'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
            'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'origin': ['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska', 'Washington', 'Oregon', 'Wyoming', 'Louisana', 'Georgia']}

In [3]:
data = pd.DataFrame(raw_data)
data

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters,origin
0,Nighthawks,1st,523.0,5,1045,1,1.0,1,4,Arizona
1,Nighthawks,1st,52.0,42,957,5,NaN,0,24,California
2,Nighthawks,2nd,25.0,2,1099,62,3.0,1,31,Texas
3,Nighthawks,2nd,616.0,2,1400,26,NaN,1,2,Florida
4,Dragoons,1st,43.0,4,1592,73,2.0,0,3,Maine
5,Dragoons,1st,234.0,7,1006,37,NaN,1,4,Iowa
6,Dragoons,2nd,523.0,8,987,949,2.0,0,24,Alaska
7,Dragoons,2nd,62.0,3,849,48,NaN,1,31,Washington
8,Scouts,1st,NaN,4,973,48,NaN,0,2,Oregon
9,Scouts,1st,73.0,7,1005,435,1.0,0,3,Wyoming
10,Scouts,2nd,37.0,8,1099,63,2.0,1,2,Louisana
11,Scouts,2nd,35.0,9,1523,345,NaN,1,3,Georgia

### Step 2. Check missing values

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   regiment   12 non-null     object
 1   company    12 non-null     object
 2   deaths     11 non-null     float64
 3   battles    12 non-null     int64
 4   size       12 non-null     int64
 5   veterans   12 non-null     int64
 6   readiness  6 non-null      float64
 7   armored    12 non-null     int64
 8   deserters  12 non-null     int64
 9   origin     12 non-null     object
dtypes: float64(2), int64(5), object(3)
memory usage: 1.1+ KB

### Step 3. Drop features, if there are more than 30% missing values.

In [5]:
# if data["readiness"].isnull().mean() > 0.3:
#     print(data.dropna())  
# else:
#     pass

# print()

data_original = data.copy()

missing_values = data_original.isnull().mean()
columns_to_drop = missing_values[missing_values > 0.3].index

data_cleaned = data_original.drop(columns=columns_to_drop)

print(data_cleaned)

      regiment company  deaths  battles  size  veterans  armored  deserters  \
0   Nighthawks     1st   523.0        5  1045         1        1          4
1   Nighthawks     1st    52.0       42   957         5        0         24
2   Nighthawks     2nd    25.0        2  1099        62        1         31
3   Nighthawks     2nd   616.0        2  1400        26        1          2
4     Dragoons     1st    43.0        4  1592        73        0          3
5     Dragoons     1st   234.0        7  1006        37        1          4
6     Dragoons     2nd   523.0        8   987       949        0         24
7     Dragoons     2nd    62.0        3   849        48        1         31
8       Scouts     1st     NaN        4   973        48        0          2
9       Scouts     1st    73.0        7  1005       435        0          3
10      Scouts     2nd    37.0        8  1099        63        1          2
11      Scouts     2nd    35.0        9  1523       345        1          3

        origin
0      Arizona
1   California
2        Texas
3      Florida
4        Maine
5         Iowa
6       Alaska
7   Washington
8       Oregon
9      Wyoming
10    Louisana
11     Georgia

### Step 4. Fill missing values with the mean of their regiment.

In [12]:
readiness_mean = data.groupby("regiment")["readiness"].mean()
data["readiness"] = data["readiness"].fillna(data["regiment"].map(readiness_mean))

deaths_mean = data.groupby("regiment")["deaths"].mean().round(1)
data["deaths"] = data["deaths"].fillna(data["regiment"].map(deaths_mean))
deaths_mean

# data

regiment
Dragoons      215.5
Nighthawks    304.0
Scouts         48.3
Name: deaths, dtype: float64

### Step 5. Set the 'origin' colum as the index of the dataframe

In [13]:
data = data.set_index('origin')
data

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523.0,5,1045,1,1.0,1,4
California,Nighthawks,1st,52.0,42,957,5,2.0,0,24
Texas,Nighthawks,2nd,25.0,2,1099,62,3.0,1,31
Florida,Nighthawks,2nd,616.0,2,1400,26,2.0,1,2
Maine,Dragoons,1st,43.0,4,1592,73,2.0,0,3
Iowa,Dragoons,1st,234.0,7,1006,37,2.0,1,4
Alaska,Dragoons,2nd,523.0,8,987,949,2.0,0,24
Washington,Dragoons,2nd,62.0,3,849,48,2.0,1,31
Oregon,Scouts,1st,48.3,4,973,48,1.5,0,2
Wyoming,Scouts,1st,73.0,7,1005,435,1.0,0,3
Louisana,Scouts,2nd,37.0,8,1099,63,2.0,1,2
Georgia,Scouts,2nd,35.0,9,1523,345,1.5,1,3

### Step 6. Select the 'deaths', 'size' and 'deserters' columns from Maine and Alaska

In [14]:
data_filtered = data.loc[data.index.isin(["Maine", "Alaska"]), ["deaths", "size", "deserters"]]
data_filtered

        deaths  size  deserters
origin
Maine     43.0  1592          3
Alaska   523.0   987         24

### Step 7. Select the rows 3 to 7 and the columns 3 to 6

In [15]:
data.iloc[2:7,3:6]

         battles  size  veterans
origin
Texas          2  1099        62
Florida        2  1400        26
Maine          4  1592        73
Iowa           7  1006        37
Alaska         8   987       949

### Step 8. Select every row after the fourth row and all columns

In [16]:
data.iloc[4:,:]

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Maine,Dragoons,1st,43.0,4,1592,73,2.0,0,3
Iowa,Dragoons,1st,234.0,7,1006,37,2.0,1,4
Alaska,Dragoons,2nd,523.0,8,987,949,2.0,0,24
Washington,Dragoons,2nd,62.0,3,849,48,2.0,1,31
Oregon,Scouts,1st,48.3,4,973,48,1.5,0,2
Wyoming,Scouts,1st,73.0,7,1005,435,1.0,0,3
Louisana,Scouts,2nd,37.0,8,1099,63,2.0,1,2
Georgia,Scouts,2nd,35.0,9,1523,345,1.5,1,3

### Step 9. Select every row up to the 4th row and all columns

In [17]:
data.iloc[:4,:]

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523.0,5,1045,1,1.0,1,4
California,Nighthawks,1st,52.0,42,957,5,2.0,0,24
Texas,Nighthawks,2nd,25.0,2,1099,62,3.0,1,31
Florida,Nighthawks,2nd,616.0,2,1400,26,2.0,1,2

### Step 10. Select the 3rd column up to the 7th column

In [18]:
data.iloc[:, 2:7]

            deaths  battles  size  veterans  readiness
origin
Arizona      523.0        5  1045         1        1.0
California    52.0       42   957         5        2.0
Texas         25.0        2  1099        62        3.0
Florida      616.0        2  1400        26        2.0
Maine         43.0        4  1592        73        2.0
Iowa         234.0        7  1006        37        2.0
Alaska       523.0        8   987       949        2.0
Washington    62.0        3   849        48        2.0
Oregon        48.3        4   973        48        1.5
Wyoming       73.0        7  1005       435        1.0
Louisana      37.0        8  1099        63        2.0
Georgia       35.0        9  1523       345        1.5

### Step 11. Select rows where df.deaths is greater than 50

In [19]:
rows = data.loc[data["deaths"]>50]
rows

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523.0,5,1045,1,1.0,1,4
California,Nighthawks,1st,52.0,42,957,5,2.0,0,24
Florida,Nighthawks,2nd,616.0,2,1400,26,2.0,1,2
Iowa,Dragoons,1st,234.0,7,1006,37,2.0,1,4
Alaska,Dragoons,2nd,523.0,8,987,949,2.0,0,24
Washington,Dragoons,2nd,62.0,3,849,48,2.0,1,31
Wyoming,Scouts,1st,73.0,7,1005,435,1.0,0,3

### Step 12. Select rows where df.deaths is greater than 500 or less than 50

In [20]:
data[(data["deaths"] > 500) | (data["deaths"] < 50)]

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523.0,5,1045,1,1.0,1,4
Texas,Nighthawks,2nd,25.0,2,1099,62,3.0,1,31
Florida,Nighthawks,2nd,616.0,2,1400,26,2.0,1,2
Maine,Dragoons,1st,43.0,4,1592,73,2.0,0,3
Alaska,Dragoons,2nd,523.0,8,987,949,2.0,0,24
Oregon,Scouts,1st,48.3,4,973,48,1.5,0,2
Louisana,Scouts,2nd,37.0,8,1099,63,2.0,1,2
Georgia,Scouts,2nd,35.0,9,1523,345,1.5,1,3

### Step 13. Select all the regiments not named "Dragoons"

In [21]:
result = data.loc[data["regiment"] != "Dragoons"]

print(result)

              regiment company  deaths  battles  size  veterans  readiness  \
origin
Arizona     Nighthawks     1st   523.0        5  1045         1        1.0
California  Nighthawks     1st    52.0       42   957         5        2.0
Texas       Nighthawks     2nd    25.0        2  1099        62        3.0
Florida     Nighthawks     2nd   616.0        2  1400        26        2.0
Oregon          Scouts     1st    48.3        4   973        48        1.5
Wyoming         Scouts     1st    73.0        7  1005       435        1.0
Louisana        Scouts     2nd    37.0        8  1099        63        2.0
Georgia         Scouts     2nd    35.0        9  1523       345        1.5

            armored  deserters
origin
Arizona           1          4
California        0         24
Texas             1         31
Florida           1          2
Oregon            0          2
Wyoming           0          3
Louisana          1          2
Georgia           1          3

### Step 14. Select the rows called Texas and Arizona

In [22]:
data.loc[["Texas", "Arizona"]]

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Texas,Nighthawks,2nd,25.0,2,1099,62,3.0,1,31
Arizona,Nighthawks,1st,523.0,5,1045,1,1.0,1,4

### Step 15. Select the third cell in the row named Arizona

In [23]:
cell = data.loc["Arizona"].iloc[2]
cell

np.float64(523.0)

### Step 16. Select the third cell down in the column named deaths

In [24]:
cell_death = data["deaths"].iloc[2]

print(cell_death)

25.0